INSERT INTO UserBookHistory (UserId, BookId, DateTaken, DateReturned) VALUES
('1c456b04-d344-4ddc-afa6-85b593454738', 1, '2023-01-01', '2023-01-10'),
('1c456b04-d344-4ddc-afa6-85b593454738', 2, '2023-02-01', '2023-02-15'),
('1c456b04-d344-4ddc-afa6-85b593454738', 3, '2023-03-05', NULL),  -- книга еще не возвращена
('1c456b04-d344-4ddc-afa6-85b593454738', 4, '2023-04-10', '2023-04-20'),
('1c456b04-d344-4ddc-afa6-85b593454738', 5, '2023-05-01', NULL),  -- книга еще не возвращена
('1c456b04-d344-4ddc-afa6-85b593454738', 6, '2023-06-01', NULL)  -- книга еще не возвращена

INSERT INTO UserBookHistory (UserId, BookId, DateTaken, DateReturned) VALUES
('e744239a-59c1-4152-84f2-5365511e568e', 7, '2023-07-01', '2023-07-10'),
('e744239a-59c1-4152-84f2-5365511e568e', 8, '2023-08-01', NULL),  -- книга еще не возвращена
('e744239a-59c1-4152-84f2-5365511e568e', 9, '2023-09-01', '2023-09-10'),
('e744239a-59c1-4152-84f2-5365511e568e', 10, '2023-10-01', NULL); -- книга еще не возвращена